{
    "data": {
        "tasks": {
            "totalCount": 19,
            "nodes": [
                {
                    "id": "18",
                    "title": "Develop a system",
                    "description": "Includes many stuffs",
                    "dueDate": "2024-05-01T01:02:00.000Z",
                    "completed": true,
                    "stageId": "2",
                    "users": [
                        {
                            "id": "1",
                            "name": "Admin User",
                            "avatarUrl": null
                        }
                    ],
                    "createdAt": "2024-04-30T10:00:09.802Z",
                    "updatedAt": "2024-04-30T10:17:42.559Z"
                },
                {
                    "id": "10",
                    "title": "Design New Logo Concepts",
                    "description": "Task: Design New Logo Concepts\n\nDescription: As part of this task, you will create multiple logo concepts that capture the essence of our brand identity. Your creativity and design expertise will play a pivotal role in developing logos that are visually appealing and resonate with our target audience.\n\nCollaboration with the marketing and branding teams will ensure that the logo concepts align with our brand guidelines and overall marketing strategy. Feedback from stakeholders will guide the iterative design process.\n\nLet's craft a new logo that represents our brand values and sets us apart in the market!",
                    "dueDate": "2024-05-02T00:26:50.342Z",
                    "completed": false,
                    "stageId": "3",
                    "users": [
                        {
                            "id": "4",
                            "name": "Pam Beesly",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/3.jpg"
                        }
                    ],
                    "createdAt": "2024-03-21T02:16:43.947Z",
                    "updatedAt": "2024-03-21T02:16:43.947Z"
                },
                {
                    "id": "6",
                    "title": "Plan Product Launch Strategy",
                    "description": "Task: Plan Product Launch Strategy\n\nDescription: In this task, you will lead the strategic planning for our upcoming product launch. You'll collaborate with cross-functional teams, including product management, marketing, and sales, to define launch objectives and key performance indicators (KPIs).\n\nYour ability to think strategically and anticipate market trends will be essential in crafting a comprehensive launch strategy. You will coordinate marketing campaigns, promotions, and sales enablement efforts to create a successful and impactful product launch.\n\nLet's plan a launch that captures the market's attention and drives substantial demand for our new product!",
                    "dueDate": "2024-05-02T03:51:21.301Z",
                    "completed": false,
                    "stageId": "2",
                    "users": [
                        {
                            "id": "5",
                            "name": "Dwight Schrute",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/4.jpg"
                        }
                    ],
                    "createdAt": "2024-03-18T12:40:58.516Z",
                    "updatedAt": "2024-04-30T09:50:54.169Z"
                },
                {
                    "id": "15",
                    "title": "Organize Charity Fundraiser",
                    "description": "Task: Organize Charity Fundraiser\n\nDescription: As the event organizer, you will be leading the efforts to organize a charity fundraiser that supports a meaningful cause. Your project management skills and event planning expertise will help create a successful and impactful event.\n\nCollaboration with the marketing and communication teams will ensure effective promotion and outreach to potential donors and sponsors. The fundraiser is an opportunity for our organization to give back to the community and make a positive impact.\n\nLet's come together to raise funds and support a cause close to our hearts!",
                    "dueDate": "2024-05-02T13:33:55.526Z",
                    "completed": false,
                    "stageId": "4",
                    "users": [
                        {
                            "id": "6",
                            "name": "Angela Martin",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/5.jpg"
                        }
                    ],
                    "createdAt": "2024-03-05T16:00:39.986Z",
                    "updatedAt": "2024-03-05T16:00:39.986Z"
                },
                {
                    "id": "2",
                    "title": "Create Marketing Campaign",
                    "description": "As part of this task, you will be responsible for designing and executing a compelling marketing campaign. The campaign will focus on promoting our latest product/service to our target audience and increasing brand visibility.\n\nYour creativity, market research, and marketing expertise will be instrumental in crafting effective messaging and selecting the right channels for the campaign. Collaboration with the design and content teams will be essential to deliver visually appealing and engaging marketing materials.\n\nLet's create a campaign that resonates with our customers and drives meaningful results!",
                    "dueDate": "2024-05-03T06:44:35.615Z",
                    "completed": false,
                    "stageId": "1",
                    "users": [
                        {
                            "id": "9",
                            "name": "Kevin Malone",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/8.jpg"
                        }
                    ],
                    "createdAt": "2024-03-03T20:12:50.125Z",
                    "updatedAt": "2024-04-30T08:51:50.641Z"
                },
                {
                    "id": "5",
                    "title": "Implement Security Enhancements",
                    "description": "Task: Implement Security Enhancements\n\nDescription: As part of this task, you will be responsible for identifying and implementing security enhancements to safeguard our systems and data. Your expertise in cybersecurity and best practices will be instrumental in mitigating potential risks and vulnerabilities.\n\nCollaboration with the IT and development teams will be essential to ensure that security measures are seamlessly integrated into our existing infrastructure. You will also conduct regular security audits and train team members on security protocols.\n\nLet's prioritize the protection of our digital assets and build a secure environment for our organization!",
                    "dueDate": "2024-05-04T03:38:39.038Z",
                    "completed": false,
                    "stageId": "1",
                    "users": [
                        {
                            "id": "3",
                            "name": "Jim Halpert",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/2.jpg"
                        }
                    ],
                    "createdAt": "2024-04-04T18:27:08.548Z",
                    "updatedAt": "2024-04-30T09:50:56.683Z"
                },
                {
                    "id": "3",
                    "title": "Develop Mobile App Prototype",
                    "description": "Task: Develop Mobile App Prototype\n\nDescription: In this task, you will lead the development of a mobile app prototype based on the product requirements and design specifications. You will work closely with the UI/UX designers, developers, and product managers to ensure the prototype aligns with the overall product vision.\n\nYour technical expertise and problem-solving skills will be crucial in overcoming challenges and refining the app's functionality and user experience. Regular testing and feedback collection will help us iterate and improve the prototype throughout the development process.\n\nLet's create a user-friendly and visually appealing prototype that sets the stage for an exceptional mobile app!",
                    "dueDate": "2024-05-04T12:17:56.930Z",
                    "completed": false,
                    "stageId": "1",
                    "users": [
                        {
                            "id": "11",
                            "name": "Creed Bratton",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/10.jpg"
                        }
                    ],
                    "createdAt": "2024-03-19T06:16:23.972Z",
                    "updatedAt": "2024-04-30T09:51:10.834Z"
                },
                {
                    "id": "1",
                    "title": "Perform Data Analysis",
                    "description": "In this task, you will analyze the collected data to uncover insights and trends. You'll use various statistical methods, data visualization techniques, and data mining algorithms to process and interpret the data. The goal is to extract valuable information that will aid in making data-driven decisions and improvements to our processes and strategies.\n\nYour analytical skills and attention to detail will play a pivotal role in the successful completion of this task. We encourage you to collaborate with the data science team and other stakeholders to ensure the accuracy and relevance of your findings.\n\nLet's turn raw data into actionable knowledge!",
                    "dueDate": "2024-05-04T17:47:18.581Z",
                    "completed": false,
                    "stageId": "1",
                    "users": [
                        {
                            "id": "11",
                            "name": "Creed Bratton",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/10.jpg"
                        },
                        {
                            "id": "5",
                            "name": "Dwight Schrute",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/4.jpg"
                        }
                    ],
                    "createdAt": "2024-03-15T08:09:47.777Z",
                    "updatedAt": "2024-04-30T10:30:38.655Z"
                },
                {
                    "id": "7",
                    "title": "Review Financial Reports",
                    "description": "Task: Review Financial Reports\n\nDescription: As part of this task, you will review and analyze financial reports to assess our company's financial health and performance. Your expertise in financial analysis and reporting will be vital in identifying trends, risks, and opportunities.\n\nCollaboration with the finance and accounting teams will ensure accurate data and a comprehensive understanding of financial metrics. Your insights and recommendations will contribute to informed decision-making and support our financial objectives.\n\nLet's review the numbers and gain valuable insights into our financial standing and growth prospects!",
                    "dueDate": "2024-05-04T20:38:15.335Z",
                    "completed": false,
                    "stageId": "1",
                    "users": [
                        {
                            "id": "2",
                            "name": "Michael Scott",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/1.jpg"
                        }
                    ],
                    "createdAt": "2024-04-26T08:34:35.304Z",
                    "updatedAt": "2024-04-30T10:43:32.026Z"
                },
                {
                    "id": "11",
                    "title": "Coordinate Project Kickoff",
                    "description": "Task: Coordinate Project Kickoff\n\nDescription: In this task, you will take charge of coordinating the project kickoff meeting, marking the official start of a new project. Your organizational skills and attention to detail will ensure that all stakeholders are informed and prepared for the project's initiation.\n\nCollaboration with project managers, team leads, and key stakeholders will help you establish project objectives, timelines, and roles. The kickoff meeting is an excellent opportunity to align everyone's expectations and set the project up for success.\n\nLet's kickstart the project with enthusiasm and a shared sense of purpose!",
                    "dueDate": "2024-05-04T21:52:36.171Z",
                    "completed": false,
                    "stageId": "3",
                    "users": [
                        {
                            "id": "2",
                            "name": "Michael Scott",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/1.jpg"
                        }
                    ],
                    "createdAt": "2024-04-15T13:17:19.551Z",
                    "updatedAt": "2024-04-15T13:17:19.551Z"
                },
                {
                    "id": "8",
                    "title": "Optimize Website Performance",
                    "description": "Task: Optimize Website Performance\n\nDescription: In this task, you will focus on optimizing our website's performance to enhance user experience and boost search engine rankings. Your technical skills and knowledge of web performance best practices will be critical in identifying and resolving performance bottlenecks.\n\nCollaboration with the web development and design teams will ensure seamless implementation of performance enhancements. You will monitor website metrics and conduct tests to measure the impact of your optimizations.\n\nLet's provide our users with a fast and smooth browsing experience while increasing our website's visibility and accessibility!",
                    "dueDate": "2024-05-05T04:11:06.788Z",
                    "completed": false,
                    "stageId": null,
                    "users": [
                        {
                            "id": "2",
                            "name": "Michael Scott",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/1.jpg"
                        }
                    ],
                    "createdAt": "2024-03-26T08:25:58.256Z",
                    "updatedAt": "2024-04-30T08:31:06.325Z"
                },
                {
                    "id": "16",
                    "title": "Coordinate Software Testing",
                    "description": "Task: Coordinate Software Testing\n\nDescription: In this task, you will be responsible for coordinating the software testing process to ensure the quality and reliability of our software products. Your attention to detail and knowledge of testing methodologies will be critical in identifying and reporting bugs and issues.\n\nCollaboration with the development and quality assurance teams will help you understand testing requirements and prioritize test cases. Regular communication with stakeholders will keep everyone informed of testing progress and results.\n\nLet's deliver software products that exceed customer expectations and meet the highest quality standards!",
                    "dueDate": "2024-05-05T05:44:18.749Z",
                    "completed": false,
                    "stageId": "4",
                    "users": [
                        {
                            "id": "9",
                            "name": "Kevin Malone",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/8.jpg"
                        }
                    ],
                    "createdAt": "2024-03-06T10:14:04.555Z",
                    "updatedAt": "2024-03-06T10:14:04.555Z"
                },
                {
                    "id": "13",
                    "title": "Write Content for Blog Posts",
                    "description": "Task: Write Content for Blog Posts\n\nDescription: In this task, you will be the voice of our company blog, creating engaging and informative content that resonates with our target audience. Your writing skills and storytelling ability will capture readers' attention and drive traffic to our blog.\n\nCollaboration with the marketing and SEO teams will help you align content topics with marketing objectives and optimize posts for search engines. Incorporating feedback from readers and stakeholders will enhance the quality and relevance of your content.\n\nLet's share valuable insights, industry trends, and exciting stories through compelling blog posts!",
                    "dueDate": "2024-05-07T06:00:30.351Z",
                    "completed": false,
                    "stageId": "4",
                    "users": [
                        {
                            "id": "3",
                            "name": "Jim Halpert",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/2.jpg"
                        },
                        {
                            "id": "3",
                            "name": "Jim Halpert",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/2.jpg"
                        },
                        {
                            "id": "3",
                            "name": "Jim Halpert",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/2.jpg"
                        },
                        {
                            "id": "3",
                            "name": "Jim Halpert",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/2.jpg"
                        },
                        {
                            "id": "3",
                            "name": "Jim Halpert",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/2.jpg"
                        },  {
                            "id": "3",
                            "name": "Jim Halpert",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/2.jpg"
                        }
                    ],
                    "createdAt": "2024-03-10T15:33:57.299Z",
                    "updatedAt": "2024-03-10T15:33:57.299Z"
                },
                {
                    "id": "4",
                    "title": "Organize Team Building Event",
                    "description": "Task: Organize Team Building Event\n\nDescription: As the event organizer, you will be responsible for planning and executing a team-building event that fosters teamwork, communication, and collaboration among team members. The event should align with our company values and contribute to a positive work culture.\n\nYour organizational skills and creativity will be essential in choosing suitable activities, selecting a venue, and coordinating logistics. By encouraging participation and engagement, you will create an enjoyable and memorable experience for all team members.\n\nLet's come together as a team and strengthen our bonds through this enriching team-building event!",
                    "dueDate": "2024-05-07T13:49:15.789Z",
                    "completed": false,
                    "stageId": "2",
                    "users": [
                        {
                            "id": "3",
                            "name": "Jim Halpert",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/2.jpg"
                        }
                    ],
                    "createdAt": "2024-03-13T04:53:30.308Z",
                    "updatedAt": "2024-04-30T08:41:26.284Z"
                },
                {
                    "id": "9",
                    "title": "Lead Sales Training Workshop",
                    "description": "Task: Lead Sales Training Workshop\n\nDescription: In this task, you will take the lead in conducting a comprehensive sales training workshop for our sales team. Your expertise in sales techniques, product knowledge, and customer communication will equip our team members with the skills they need to excel.\n\nCollaboration with sales managers and team leads will help you tailor the workshop content to address specific challenges and opportunities. Interactive activities and role-playing scenarios will enhance the learning experience.\n\nLet's empower our sales team with the knowledge and confidence to achieve exceptional sales performance!",
                    "dueDate": "2024-05-07T18:19:25.900Z",
                    "completed": false,
                    "stageId": "3",
                    "users": [
                        {
                            "id": "1",
                            "name": "Admin User",
                            "avatarUrl": null
                        }
                    ],
                    "createdAt": "2024-03-15T20:22:53.005Z",
                    "updatedAt": "2024-03-15T20:22:53.005Z"
                },
                {
                    "id": "12",
                    "title": "Conduct Market Research",
                    "description": "Task: Conduct Market Research\n\nDescription: In this task, you will conduct market research to gain a deeper understanding of our target market, customer preferences, and competitor landscape. Your research findings will inform our marketing, product, and business strategies.\n\nCollaboration with the marketing and product teams will help you define research objectives and design data collection methods. Your analytical skills and data interpretation will provide valuable insights for strategic decision-making.\n\nLet's gather market intelligence that drives our company's growth and competitive advantage!",
                    "dueDate": "2024-05-08T10:23:19.039Z",
                    "completed": false,
                    "stageId": "3",
                    "users": [
                        {
                            "id": "5",
                            "name": "Dwight Schrute",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/4.jpg"
                        }
                    ],
                    "createdAt": "2024-04-01T12:35:28.784Z",
                    "updatedAt": "2024-04-01T12:35:28.784Z"
                },
                {
                    "id": "14",
                    "title": "Facilitate Client Feedback Session",
                    "description": "Task: Facilitate Client Feedback Session\n\nDescription: In this task, you will organize and facilitate a feedback session with our clients to gather their insights and opinions. Your excellent communication and interpersonal skills will create a comfortable environment for clients to share candid feedback.\n\nCollaboration with the client success and support teams will help you identify relevant topics and tailor the session to address specific concerns. The feedback received will be invaluable in improving our products/services and strengthening client relationships.\n\nLet's listen to our clients' voices and use their feedback to drive continuous improvement!",
                    "dueDate": "2024-05-10T02:07:12.057Z",
                    "completed": false,
                    "stageId": "4",
                    "users": [
                        {
                            "id": "12",
                            "name": "Meredith Palmer",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/11.jpg"
                        }
                    ],
                    "createdAt": "2024-04-08T21:02:56.676Z",
                    "updatedAt": "2024-04-08T21:02:56.676Z"
                },
                {
                    "id": "17",
                    "title": "go to the cinema",
                    "description": "sherif is a fineugly boy",
                    "dueDate": null,
                    "completed": true,
                    "stageId": "1",
                    "users": [],
                    "createdAt": "2024-04-30T09:39:02.419Z",
                    "updatedAt": "2024-04-30T09:43:38.982Z"
                },
                {
                    "id": "19",
                    "title": "My life",
                    "description": null,
                    "dueDate": null,
                    "completed": false,
                    "stageId": null,
                    "users": [
                        {
                            "id": "3",
                            "name": "Jim Halpert",
                            "avatarUrl": "https://refine-crm.ams3.cdn.digitaloceanspaces.com/avatars/2.jpg"
                        }
                    ],
                    "createdAt": "2024-04-30T10:10:52.634Z",
                    "updatedAt": "2024-04-30T10:11:01.968Z"
                }
            ]
        }
    }
}